function M_RGB = M_RGB_GEN(n)
% 根据总数n生成色值矩阵（由蓝到红），最终总共有n+1行
%     R    G    B
% 蓝  0    0   255
% 青  0   255  255
% 绿  0   255   0
% 黄 255  255   0
% 红 255   0    0
% 此处显示详细说明
%% 从蓝到青
for i=0:(n/4)
    M_RGB(i+1,:)=[0 0 255]+(i-0)*([0 255 255]-[0 0 255])/(n/4);    
end

%% 从青到绿
for i=(n/4):(n/2)
    M_RGB(i+1,:)=[0 255 255]+(i-n/4)*([0 255 0]-[0 255 255])/(n/4);    
end

%% 从绿到黄
for i=(n/2):(3*n/4)
    M_RGB(i+1,:)=[0 255 0]+(i-n/2)*([255 255 0]-[0 255 0])/(n/4);    
end

%% 从黄到红
for i=(3*n/4):(n)
    M_RGB(i+1,:)=[255 255 0]+(i-3*n/4)*([255 0 0]-[255 255 0])/(n/4);    
end

M_RGB=M_RGB/255;
end

