classdef class_BODY_PARA
    properties
        %机器人结构参数
        Link_A=[251/1000,35.3553/2/1000,127/1000].*1000  %a1 a2 a3
        Link_B=[202.9166/1000,38.3391/1000,60.8790/1000].*1000 %b1 b2 b3
        Link_L=[213.6473/1000,406.3691/1000,406.3691/1000,448.7958/1000,5.3619/1000].*1000 %l1 l2 l3 l4 l1x
        Link_P=[129/1000,124/1000,27.7771/1000,26.0140/1000,124/1000,27.7771/1000,26.0140/1000;].*1000% p1 p2x p2y p2z p3x p3y p3z
        Link_D=863/2000.*1000;%d
        Link_H=451;
        Link_C=166;  %C系原点到机身底面的垂直距离
%         a1=251/1000;       b1=202.9166/1000;   a2=35.3553/2/1000;      b2=38.3391/1000;     a3=127/1000;     b3=60.8790/1000;  
% l1=213.6473/1000;      l2=406.3691/1000;     l3=406.3691/1000;   l4=448.7958/1000; l1x=5.3619/1000;
% d=863/2000;
% h = 451;          theta_in=pi/6;   theta_m=17.6909*pi/180;     theta_ex=pi/6;          theta_p=(40*pi)/180 ;         p1=129/1000;  
% p2x=124/1000;     p2y=27.7771/1000;     p2z=26.0140/1000;
% p3x=124/1000;     p3y=27.7771/1000;     p3z=26.0140/1000;
        
        Angle=[pi/6,17.6909*pi/180,pi/6,(40*pi)/180]% theta_in theta_m theta_ex theta_p
%         Lim_alpha=[-3*pi/3,0;-3*pi/3,0;-3*pi/3,0]    %alpha1,2,3的极值，第一列为最小值，第二列为最大值
        Lim_alpha=[-1.13882733692630,0;-1.1043,0;-1.1043,0]    %alpha1,2,3的极值，第一列为最小值，第二列为最大值
        Lim_phi=[-pi/2,pi/2;-pi/2,pi/2;pi/2,-pi/2]   %phi1,2,3的极值，第一列为最小值，第二列为最大值
        Lim_beta=[-pi/3,pi/3;-pi/3,pi/3;-pi/3,pi/3]  %beta1,2,3的极值，第一列为最小值，第二列为最大值
        Lim_gama=[-pi/3,pi/3;-pi/3,pi/3;-pi/3,pi/3]  %gama1,2,3的极值，第一列为最小值，第二列为最大值
        Init_phi=[0,0,-pi];
        Init_alpha=[0,0,0];
%         -63.27
        %辅传动
        Q_transmech=[82.4761/1000,141.0035/1000,61/1000,24/1000,18.5/1000,103.8522/1000,9/1000].*1000;%q1,q2,q3x,q3z,q4x,q4y,q4z
        %主传动
        Q_Pritransmech=[(167.2238*pi)/180,(43.3231*pi)/180,pi/2-pi/6,229.5545/1000,172.1663/1000].*1000;%theta_t0,theta_d,theta_origin1,d2,d3
        
        %机身坐标系与单腿坐标系的变换矩阵
%         TCB
    end
    
   %添加轨迹目前的办法就是修改Move函数和show函数
    
    methods
    end
      
end